app/controllers/questions_controller.rb

INSERT INTO "questions" ("question_text", "question_type", "answer_options", "survey_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["question_text", "First Question"], ["question_type", "Text"], ["answer_options", ""], ["survey_id", 1], ["created_at", "2015-03-31 20:09:21.714174"], ["updated_at", "2015-03-31 20:09:21.714174"]]
---
  def create
    @question = Question.new(question_params.merge(:survey => @survey))
    if @question.save!

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @question = Question.find(params[:id])

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "questions" SET "question_text" = ?, "updated_at" = ? WHERE "questions"."id" = ?  [["question_text", "New First Question"], ["updated_at", "2015-04-01 01:49:49.903715"], ["id", 1]]
---
  def update
    @question = Question.find(params[:id])
    @updated_question = question_params.merge(:survey => @survey)
    if @question.update_attributes!(@updated_question)

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", 4]]
DELETE FROM "questions" WHERE "questions"."id" = ?  [["id", 4]]
---
  def destroy
    @question = Question.find(params[:id])
    @question.destroy

SELECT  "surveys".* FROM "surveys" WHERE "surveys"."id" = ? LIMIT 1  [["id", 5]]
---
  def find_survey!
    @survey =  Survey.find(params[:survey_id])