app/controllers/surveys_controller.rb

SELECT "surveys".* FROM "surveys"
---
	def index
		@surveys = Survey.all

SELECT  "surveys".* FROM "surveys" WHERE "surveys"."id" = ? LIMIT 1  [["id", 1]]
---
	def show
		id = params[:id] # get survey from URL
		@survey = Survey.find(id)

INSERT INTO "surveys" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "My New Survey"], ["created_at", "2015-03-23 23:58:24.130666"], ["updated_at", "2015-03-23 23:58:24.130666"]]
---
  def create
    @survey = Survey.new(survey_params)
    if @survey.save

SELECT  "surveys".* FROM "surveys" WHERE "surveys"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @survey = Survey.find(params[:id])

SELECT  "surveys".* FROM "surveys" WHERE "surveys"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "surveys" SET "title" = ?, "updated_at" = ? WHERE "surveys"."id" = ?  [["title", "New Test Survey 1"], ["updated_at", "2015-04-01 01:09:36.901197"], ["id", 1]]
---
  def update
    @survey = Survey.find(params[:id])
    if @survey.update_attributes!(survey_params)

SELECT  "surveys".* FROM "surveys" WHERE "surveys"."id" = ? LIMIT 1  [["id", 6]]
DELETE FROM "surveys" WHERE "surveys"."id" = ?  [["id", 6]]
---
  def destroy
    @survey = Survey.find(params[:id])
    @survey.destroy